dunknowcoding/NiusBurner/niusburner/arduino/pic16/boards.txt
pic16f628a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f628a.menu.compiler.auto.build.nb_compiler=auto
pic16f628a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f628a.menu.compiler.configured.build.nb_compiler=configured

pic16f628a.menu.fcpu.board=As the board says (default)
pic16f628a.menu.fcpu.board.build.nb_fcpu=board
pic16f628a.menu.fcpu.4000000=4 MHz
pic16f628a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f628a.menu.fcpu.8000000=8 MHz
pic16f628a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f628a.menu.fcpu.11059200=11.0592 MHz
pic16f628a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f628a.menu.fcpu.12000000=12 MHz
pic16f628a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f628a.menu.fcpu.16000000=16 MHz
pic16f628a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f628a.menu.fcpu.20000000=20 MHz
pic16f628a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f628a.menu.fcpu.22118400=22.1184 MHz
pic16f628a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f628a.menu.fcpu.24000000=24 MHz
pic16f628a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 K words, 18-pin, USART, comparators.
pic16f648a.name=PIC16F series - 16F648A (4 K words, PICkit 3) [experimental]
pic16f648a.upload.tool=niusburner
pic16f648a.upload.protocol=pickit3
pic16f648a.upload.maximum_size=4096
pic16f648a.upload.maximum_data_size=256
pic16f648a.upload.require_upload_port=false
pic16f648a.build.mcu=16F648A
pic16f648a.build.f_cpu=20000000L
pic16f648a.build.board=16F648A
pic16f648a.build.core=niusburner
pic16f648a.build.variant=standard
pic16f648a.build.nb_board=pic16f648a
pic16f648a.build.extra_flags=

pic16f648a.menu.optimize.size=Size (default)
pic16f648a.menu.optimize.size.build.nb_optimize=size
pic16f648a.menu.optimize.speed=Speed
pic16f648a.menu.optimize.speed.build.nb_optimize=speed
pic16f648a.menu.optimize.none=None
pic16f648a.menu.optimize.none.build.nb_optimize=none

pic16f648a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f648a.menu.compiler.auto.build.nb_compiler=auto
pic16f648a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f648a.menu.compiler.configured.build.nb_compiler=configured

pic16f648a.menu.fcpu.board=As the board says (default)
pic16f648a.menu.fcpu.board.build.nb_fcpu=board
pic16f648a.menu.fcpu.4000000=4 MHz
pic16f648a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f648a.menu.fcpu.8000000=8 MHz
pic16f648a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f648a.menu.fcpu.11059200=11.0592 MHz
pic16f648a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f648a.menu.fcpu.12000000=12 MHz
pic16f648a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f648a.menu.fcpu.16000000=16 MHz
pic16f648a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f648a.menu.fcpu.20000000=20 MHz
pic16f648a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f648a.menu.fcpu.22118400=22.1184 MHz
pic16f648a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f648a.menu.fcpu.24000000=24 MHz
pic16f648a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 1 K words, 18-pin, no USART and no analog.
pic16f84a.name=PIC16F series - 16F84A (1 K words, PICkit 3) [experimental]
pic16f84a.upload.tool=niusburner
pic16f84a.upload.protocol=pickit3
pic16f84a.upload.maximum_size=1024
pic16f84a.upload.maximum_data_size=68
pic16f84a.upload.require_upload_port=false
pic16f84a.build.mcu=16F84A
pic16f84a.build.f_cpu=20000000L
pic16f84a.build.board=16F84A
pic16f84a.build.core=niusburner
pic16f84a.build.variant=standard
pic16f84a.build.nb_board=pic16f84a
pic16f84a.build.extra_flags=

pic16f84a.menu.optimize.size=Size (default)
pic16f84a.menu.optimize.size.build.nb_optimize=size
pic16f84a.menu.optimize.speed=Speed
pic16f84a.menu.optimize.speed.build.nb_optimize=speed
pic16f84a.menu.optimize.none=None
pic16f84a.menu.optimize.none.build.nb_optimize=none

pic16f84a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f84a.menu.compiler.auto.build.nb_compiler=auto
pic16f84a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f84a.menu.compiler.configured.build.nb_compiler=configured

pic16f84a.menu.fcpu.board=As the board says (default)
pic16f84a.menu.fcpu.board.build.nb_fcpu=board
pic16f84a.menu.fcpu.4000000=4 MHz
pic16f84a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f84a.menu.fcpu.8000000=8 MHz
pic16f84a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f84a.menu.fcpu.11059200=11.0592 MHz
pic16f84a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f84a.menu.fcpu.12000000=12 MHz
pic16f84a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f84a.menu.fcpu.16000000=16 MHz
pic16f84a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f84a.menu.fcpu.20000000=20 MHz
pic16f84a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f84a.menu.fcpu.22118400=22.1184 MHz
pic16f84a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f84a.menu.fcpu.24000000=24 MHz
pic16f84a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f873.name=PIC16F series - 16F873 (4 K words, PICkit 3) [experimental]
pic16f873.upload.tool=niusburner
pic16f873.upload.protocol=pickit3
pic16f873.upload.maximum_size=4096
pic16f873.upload.maximum_data_size=192
pic16f873.upload.require_upload_port=false
pic16f873.build.mcu=16F873
pic16f873.build.f_cpu=20000000L
pic16f873.build.board=16F873
pic16f873.build.core=niusburner
pic16f873.build.variant=standard
pic16f873.build.nb_board=pic16f873
pic16f873.build.extra_flags=

pic16f873.menu.optimize.size=Size (default)
pic16f873.menu.optimize.size.build.nb_optimize=size
pic16f873.menu.optimize.speed=Speed
pic16f873.menu.optimize.speed.build.nb_optimize=speed
pic16f873.menu.optimize.none=None
pic16f873.menu.optimize.none.build.nb_optimize=none

pic16f873.menu.compiler.auto=Auto-detect SDCC (default)
pic16f873.menu.compiler.auto.build.nb_compiler=auto
pic16f873.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f873.menu.compiler.configured.build.nb_compiler=configured

pic16f873.menu.fcpu.board=As the board says (default)
pic16f873.menu.fcpu.board.build.nb_fcpu=board
pic16f873.menu.fcpu.4000000=4 MHz
pic16f873.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f873.menu.fcpu.8000000=8 MHz
pic16f873.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f873.menu.fcpu.11059200=11.0592 MHz
pic16f873.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f873.menu.fcpu.12000000=12 MHz
pic16f873.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f873.menu.fcpu.16000000=16 MHz
pic16f873.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f873.menu.fcpu.20000000=20 MHz
pic16f873.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f873.menu.fcpu.22118400=22.1184 MHz
pic16f873.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f873.menu.fcpu.24000000=24 MHz
pic16f873.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f873a.name=PIC16F series - 16F873A (4 K words, PICkit 3)
pic16f873a.upload.tool=niusburner
pic16f873a.upload.protocol=pickit3
pic16f873a.upload.maximum_size=4096
pic16f873a.upload.maximum_data_size=192
pic16f873a.upload.require_upload_port=false
pic16f873a.build.mcu=16F873A
pic16f873a.build.f_cpu=20000000L
pic16f873a.build.board=16F873A
pic16f873a.build.core=niusburner
pic16f873a.build.variant=standard
pic16f873a.build.nb_board=pic16f873a
pic16f873a.build.extra_flags=

pic16f873a.menu.optimize.size=Size (default)
pic16f873a.menu.optimize.size.build.nb_optimize=size
pic16f873a.menu.optimize.speed=Speed
pic16f873a.menu.optimize.speed.build.nb_optimize=speed
pic16f873a.menu.optimize.none=None
pic16f873a.menu.optimize.none.build.nb_optimize=none

pic16f873a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f873a.menu.compiler.auto.build.nb_compiler=auto
pic16f873a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f873a.menu.compiler.configured.build.nb_compiler=configured

pic16f873a.menu.fcpu.board=As the board says (default)
pic16f873a.menu.fcpu.board.build.nb_fcpu=board
pic16f873a.menu.fcpu.4000000=4 MHz
pic16f873a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f873a.menu.fcpu.8000000=8 MHz
pic16f873a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f873a.menu.fcpu.11059200=11.0592 MHz
pic16f873a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f873a.menu.fcpu.12000000=12 MHz
pic16f873a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f873a.menu.fcpu.16000000=16 MHz
pic16f873a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f873a.menu.fcpu.20000000=20 MHz
pic16f873a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f873a.menu.fcpu.22118400=22.1184 MHz
pic16f873a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f873a.menu.fcpu.24000000=24 MHz
pic16f873a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f874.name=PIC16F series - 16F874 (4 K words, PICkit 3) [experimental]
pic16f874.upload.tool=niusburner
pic16f874.upload.protocol=pickit3
pic16f874.upload.maximum_size=4096
pic16f874.upload.maximum_data_size=192
pic16f874.upload.require_upload_port=false
pic16f874.build.mcu=16F874
pic16f874.build.f_cpu=20000000L
pic16f874.build.board=16F874
pic16f874.build.core=niusburner
pic16f874.build.variant=standard
pic16f874.build.nb_board=pic16f874
pic16f874.build.extra_flags=

pic16f874.menu.optimize.size=Size (default)
pic16f874.menu.optimize.size.build.nb_optimize=size
pic16f874.menu.optimize.speed=Speed
pic16f874.menu.optimize.speed.build.nb_optimize=speed
pic16f874.menu.optimize.none=None
pic16f874.menu.optimize.none.build.nb_optimize=none

pic16f874.menu.compiler.auto=Auto-detect SDCC (default)
pic16f874.menu.compiler.auto.build.nb_compiler=auto
pic16f874.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f874.menu.compiler.configured.build.nb_compiler=configured

pic16f874.menu.fcpu.board=As the board says (default)
pic16f874.menu.fcpu.board.build.nb_fcpu=board
pic16f874.menu.fcpu.4000000=4 MHz
pic16f874.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f874.menu.fcpu.8000000=8 MHz
pic16f874.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f874.menu.fcpu.11059200=11.0592 MHz
pic16f874.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f874.menu.fcpu.12000000=12 MHz
pic16f874.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f874.menu.fcpu.16000000=16 MHz
pic16f874.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f874.menu.fcpu.20000000=20 MHz
pic16f874.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f874.menu.fcpu.22118400=22.1184 MHz
pic16f874.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f874.menu.fcpu.24000000=24 MHz
pic16f874.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 K words flash, 192 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f874a.name=PIC16F series - 16F874A (4 K words, PICkit 3)
pic16f874a.upload.tool=niusburner
pic16f874a.upload.protocol=pickit3
pic16f874a.upload.maximum_size=4096
pic16f874a.upload.maximum_data_size=192
pic16f874a.upload.require_upload_port=false
pic16f874a.build.mcu=16F874A
pic16f874a.build.f_cpu=20000000L
pic16f874a.build.board=16F874A
pic16f874a.build.core=niusburner
pic16f874a.build.variant=standard
pic16f874a.build.nb_board=pic16f874a
pic16f874a.build.extra_flags=

pic16f874a.menu.optimize.size=Size (default)
pic16f874a.menu.optimize.size.build.nb_optimize=size
pic16f874a.menu.optimize.speed=Speed
pic16f874a.menu.optimize.speed.build.nb_optimize=speed
pic16f874a.menu.optimize.none=None
pic16f874a.menu.optimize.none.build.nb_optimize=none

pic16f874a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f874a.menu.compiler.auto.build.nb_compiler=auto
pic16f874a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f874a.menu.compiler.configured.build.nb_compiler=configured

pic16f874a.menu.fcpu.board=As the board says (default)
pic16f874a.menu.fcpu.board.build.nb_fcpu=board
pic16f874a.menu.fcpu.4000000=4 MHz
pic16f874a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f874a.menu.fcpu.8000000=8 MHz
pic16f874a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f874a.menu.fcpu.11059200=11.0592 MHz
pic16f874a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f874a.menu.fcpu.12000000=12 MHz
pic16f874a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f874a.menu.fcpu.16000000=16 MHz
pic16f874a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f874a.menu.fcpu.20000000=20 MHz
pic16f874a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f874a.menu.fcpu.22118400=22.1184 MHz
pic16f874a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f874a.menu.fcpu.24000000=24 MHz
pic16f874a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f876.name=PIC16F series - 16F876 (8 K words, PICkit 3) [experimental]
pic16f876.upload.tool=niusburner
pic16f876.upload.protocol=pickit3
pic16f876.upload.maximum_size=8192
pic16f876.upload.maximum_data_size=368
pic16f876.upload.require_upload_port=false
pic16f876.build.mcu=16F876
pic16f876.build.f_cpu=20000000L
pic16f876.build.board=16F876
pic16f876.build.core=niusburner
pic16f876.build.variant=standard
pic16f876.build.nb_board=pic16f876
pic16f876.build.extra_flags=

pic16f876.menu.optimize.size=Size (default)
pic16f876.menu.optimize.size.build.nb_optimize=size
pic16f876.menu.optimize.speed=Speed
pic16f876.menu.optimize.speed.build.nb_optimize=speed
pic16f876.menu.optimize.none=None
pic16f876.menu.optimize.none.build.nb_optimize=none

pic16f876.menu.compiler.auto=Auto-detect SDCC (default)
pic16f876.menu.compiler.auto.build.nb_compiler=auto
pic16f876.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f876.menu.compiler.configured.build.nb_compiler=configured

pic16f876.menu.fcpu.board=As the board says (default)
pic16f876.menu.fcpu.board.build.nb_fcpu=board
pic16f876.menu.fcpu.4000000=4 MHz
pic16f876.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f876.menu.fcpu.8000000=8 MHz
pic16f876.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f876.menu.fcpu.11059200=11.0592 MHz
pic16f876.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f876.menu.fcpu.12000000=12 MHz
pic16f876.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f876.menu.fcpu.16000000=16 MHz
pic16f876.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f876.menu.fcpu.20000000=20 MHz
pic16f876.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f876.menu.fcpu.22118400=22.1184 MHz
pic16f876.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f876.menu.fcpu.24000000=24 MHz
pic16f876.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 28-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A, with ports A-C only.
pic16f876a.name=PIC16F series - 16F876A (8 K words, PICkit 3)
pic16f876a.upload.tool=niusburner
pic16f876a.upload.protocol=pickit3
pic16f876a.upload.maximum_size=8192
pic16f876a.upload.maximum_data_size=368
pic16f876a.upload.require_upload_port=false
pic16f876a.build.mcu=16F876A
pic16f876a.build.f_cpu=20000000L
pic16f876a.build.board=16F876A
pic16f876a.build.core=niusburner
pic16f876a.build.variant=standard
pic16f876a.build.nb_board=pic16f876a
pic16f876a.build.extra_flags=

