dunknowcoding/NiusBurner/niusburner/arduino/pic16/boards.txt
pic16f876a.menu.optimize.size=Size (default)
pic16f876a.menu.optimize.size.build.nb_optimize=size
pic16f876a.menu.optimize.speed=Speed
pic16f876a.menu.optimize.speed.build.nb_optimize=speed
pic16f876a.menu.optimize.none=None
pic16f876a.menu.optimize.none.build.nb_optimize=none

pic16f876a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f876a.menu.compiler.auto.build.nb_compiler=auto
pic16f876a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f876a.menu.compiler.configured.build.nb_compiler=configured

pic16f876a.menu.fcpu.board=As the board says (default)
pic16f876a.menu.fcpu.board.build.nb_fcpu=board
pic16f876a.menu.fcpu.4000000=4 MHz
pic16f876a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f876a.menu.fcpu.8000000=8 MHz
pic16f876a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f876a.menu.fcpu.11059200=11.0592 MHz
pic16f876a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f876a.menu.fcpu.12000000=12 MHz
pic16f876a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f876a.menu.fcpu.16000000=16 MHz
pic16f876a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f876a.menu.fcpu.20000000=20 MHz
pic16f876a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f876a.menu.fcpu.22118400=22.1184 MHz
pic16f876a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f876a.menu.fcpu.24000000=24 MHz
pic16f876a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 40-pin. PICkit 3 over ICSP. USART on RC6/RC7. Same register layout as the 16F877A.
pic16f877.name=PIC16F series - 16F877 (8 K words, PICkit 3) [experimental]
pic16f877.upload.tool=niusburner
pic16f877.upload.protocol=pickit3
pic16f877.upload.maximum_size=8192
pic16f877.upload.maximum_data_size=368
pic16f877.upload.require_upload_port=false
pic16f877.build.mcu=16F877
pic16f877.build.f_cpu=20000000L
pic16f877.build.board=16F877
pic16f877.build.core=niusburner
pic16f877.build.variant=standard
pic16f877.build.nb_board=pic16f877
pic16f877.build.extra_flags=

pic16f877.menu.optimize.size=Size (default)
pic16f877.menu.optimize.size.build.nb_optimize=size
pic16f877.menu.optimize.speed=Speed
pic16f877.menu.optimize.speed.build.nb_optimize=speed
pic16f877.menu.optimize.none=None
pic16f877.menu.optimize.none.build.nb_optimize=none

pic16f877.menu.compiler.auto=Auto-detect SDCC (default)
pic16f877.menu.compiler.auto.build.nb_compiler=auto
pic16f877.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f877.menu.compiler.configured.build.nb_compiler=configured

pic16f877.menu.fcpu.board=As the board says (default)
pic16f877.menu.fcpu.board.build.nb_fcpu=board
pic16f877.menu.fcpu.4000000=4 MHz
pic16f877.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f877.menu.fcpu.8000000=8 MHz
pic16f877.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f877.menu.fcpu.11059200=11.0592 MHz
pic16f877.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f877.menu.fcpu.12000000=12 MHz
pic16f877.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f877.menu.fcpu.16000000=16 MHz
pic16f877.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f877.menu.fcpu.20000000=20 MHz
pic16f877.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f877.menu.fcpu.22118400=22.1184 MHz
pic16f877.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f877.menu.fcpu.24000000=24 MHz
pic16f877.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 8 K words flash, 368 B RAM, 256 B EEPROM. PICkit 3 over ICSP. USART on RC6/RC7. Unlike a classic 8051 this part has real I2C, SPI, PWM and ADC hardware.
pic16f877a.name=PIC16F series - 16F877A (8 K words, PICkit 3)
pic16f877a.upload.tool=niusburner
pic16f877a.upload.protocol=pickit3
pic16f877a.upload.maximum_size=8192
pic16f877a.upload.maximum_data_size=368
pic16f877a.upload.require_upload_port=false
pic16f877a.build.mcu=16F877A
pic16f877a.build.f_cpu=20000000L
pic16f877a.build.board=16F877A
pic16f877a.build.core=niusburner
pic16f877a.build.variant=standard
pic16f877a.build.nb_board=pic16f877a
pic16f877a.build.extra_flags=

pic16f877a.menu.optimize.size=Size (default)
pic16f877a.menu.optimize.size.build.nb_optimize=size
pic16f877a.menu.optimize.speed=Speed
pic16f877a.menu.optimize.speed.build.nb_optimize=speed
pic16f877a.menu.optimize.none=None
pic16f877a.menu.optimize.none.build.nb_optimize=none

pic16f877a.menu.compiler.auto=Auto-detect SDCC (default)
pic16f877a.menu.compiler.auto.build.nb_compiler=auto
pic16f877a.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f877a.menu.compiler.configured.build.nb_compiler=configured

pic16f877a.menu.fcpu.board=As the board says (default)
pic16f877a.menu.fcpu.board.build.nb_fcpu=board
pic16f877a.menu.fcpu.4000000=4 MHz
pic16f877a.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f877a.menu.fcpu.8000000=8 MHz
pic16f877a.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f877a.menu.fcpu.11059200=11.0592 MHz
pic16f877a.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f877a.menu.fcpu.12000000=12 MHz
pic16f877a.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f877a.menu.fcpu.16000000=16 MHz
pic16f877a.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f877a.menu.fcpu.20000000=20 MHz
pic16f877a.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f877a.menu.fcpu.22118400=22.1184 MHz
pic16f877a.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f877a.menu.fcpu.24000000=24 MHz
pic16f877a.menu.fcpu.24000000.build.nb_fcpu=24000000

# ----------------------------------------------------------------------
# 4 K words, 18-pin, USART, ANSEL analog select.
pic16f88.name=PIC16F series - 16F88 (4 K words, PICkit 3) [experimental]
pic16f88.upload.tool=niusburner
pic16f88.upload.protocol=pickit3
pic16f88.upload.maximum_size=4096
pic16f88.upload.maximum_data_size=368
pic16f88.upload.require_upload_port=false
pic16f88.build.mcu=16F88
pic16f88.build.f_cpu=20000000L
pic16f88.build.board=16F88
pic16f88.build.core=niusburner
pic16f88.build.variant=standard
pic16f88.build.nb_board=pic16f88
pic16f88.build.extra_flags=

pic16f88.menu.optimize.size=Size (default)
pic16f88.menu.optimize.size.build.nb_optimize=size
pic16f88.menu.optimize.speed=Speed
pic16f88.menu.optimize.speed.build.nb_optimize=speed
pic16f88.menu.optimize.none=None
pic16f88.menu.optimize.none.build.nb_optimize=none

pic16f88.menu.compiler.auto=Auto-detect SDCC (default)
pic16f88.menu.compiler.auto.build.nb_compiler=auto
pic16f88.menu.compiler.configured=Use the path from `niusburner setup --sdcc`
pic16f88.menu.compiler.configured.build.nb_compiler=configured

pic16f88.menu.fcpu.board=As the board says (default)
pic16f88.menu.fcpu.board.build.nb_fcpu=board
pic16f88.menu.fcpu.4000000=4 MHz
pic16f88.menu.fcpu.4000000.build.nb_fcpu=4000000
pic16f88.menu.fcpu.8000000=8 MHz
pic16f88.menu.fcpu.8000000.build.nb_fcpu=8000000
pic16f88.menu.fcpu.11059200=11.0592 MHz
pic16f88.menu.fcpu.11059200.build.nb_fcpu=11059200
pic16f88.menu.fcpu.12000000=12 MHz
pic16f88.menu.fcpu.12000000.build.nb_fcpu=12000000
pic16f88.menu.fcpu.16000000=16 MHz
pic16f88.menu.fcpu.16000000.build.nb_fcpu=16000000
pic16f88.menu.fcpu.20000000=20 MHz
pic16f88.menu.fcpu.20000000.build.nb_fcpu=20000000
pic16f88.menu.fcpu.22118400=22.1184 MHz
pic16f88.menu.fcpu.22118400.build.nb_fcpu=22118400
pic16f88.menu.fcpu.24000000=24 MHz
pic16f88.menu.fcpu.24000000.build.nb_fcpu=24000000
